grupos/grupo-08-reservas-turnos/Tarea 4 - Yessica Ferreira/reporte-html/statistics.json
{
  "GET - Consultar Reserva-0" : {
    "transaction" : "GET - Consultar Reserva-0",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 177.0,
    "medianResTime" : 90.0,
    "minResTime" : 63.0,
    "maxResTime" : 378.0,
    "pct1ResTime" : 378.0,
    "pct2ResTime" : 378.0,
    "pct3ResTime" : 378.0,
    "throughput" : 0.45864546705396725,
    "receivedKBytesPerSec" : 0.1813978653875554,
    "sentKBytesPerSec" : 0.1021202797737349
  },
  "GET - Consultar Reserva" : {
    "transaction" : "GET - Consultar Reserva",
    "sampleCount" : 20,
    "errorCount" : 4,
    "errorPct" : 20.0,
    "meanResTime" : 410.65,
    "medianResTime" : 313.5,
    "minResTime" : 260.0,
    "maxResTime" : 1610.0,
    "pct1ResTime" : 606.5000000000001,
    "pct2ResTime" : 1560.0499999999993,
    "pct3ResTime" : 1610.0,
    "throughput" : 0.35648082133181236,
    "receivedKBytesPerSec" : 0.23167772128546985,
    "sentKBytesPerSec" : 0.0918181802990874
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 46,
    "errorCount" : 10,
    "errorPct" : 21.73913,
    "meanResTime" : 588.6956521739131,
    "medianResTime" : 397.5,
    "minResTime" : 63.0,
    "maxResTime" : 3762.0,
    "pct1ResTime" : 1558.9000000000003,
    "pct2ResTime" : 1817.0999999999997,
    "pct3ResTime" : 3762.0,
    "throughput" : 0.7931991792112841,
    "receivedKBytesPerSec" : 0.47584541453278845,
    "sentKBytesPerSec" : 0.24181258945045092
  },
  "GET - Consultar Reserva-1" : {
    "transaction" : "GET - Consultar Reserva-1",
    "sampleCount" : 3,
    "errorCount" : 3,
    "errorPct" : 100.0,
    "meanResTime" : 257.6666666666667,
    "medianResTime" : 188.0,
    "minResTime" : 187.0,
    "maxResTime" : 398.0,
    "pct1ResTime" : 398.0,
    "pct2ResTime" : 398.0,
    "pct3ResTime" : 398.0,
    "throughput" : 0.45187528242205155,
    "receivedKBytesPerSec" : 0.264035199201687,
    "sentKBytesPerSec" : 0.10017157139629462
  },
  "POST - Crear Reserva" : {
    "transaction" : "POST - Crear Reserva",
    "sampleCount" : 20,
    "errorCount" : 3,
    "errorPct" : 15.0,
    "meanResTime" : 878.15,
    "medianResTime" : 557.0,
    "minResTime" : 280.0,
    "maxResTime" : 3762.0,
    "pct1ResTime" : 1855.6000000000004,
    "pct2ResTime" : 3667.449999999999,
    "pct3ResTime" : 3762.0,
    "throughput" : 0.3482682361955178,
    "receivedKBytesPerSec" : 0.2030090919776412,
    "sentKBytesPerSec" : 0.13128079997213854
  }
}